x = int(input('длина новой стены 1'))
y = int(input('длина новой стены 2'))
l = int(input('длина уцелевшей стены'))
c1 = int(input('цена ремонта погонного метра уцелевшей стены'))
c2 = int(input('цена разбора погонного метра уцелевшей стены'))
c3 = int(input('цена строительства погонного метра из материала уцелевшей стены'))
c4 = int(input('цена строительства погонного метра из нового материала'))
c5 = int(input('цена погонного метра нового материала'))
c6 = int(input('цена вывоза погонного метра на свалку'))

if l > x:
    cena = ((l-x)*c2) + ((l-x)*c3) + ((l-(l-x))*c1) + (x*c4) + (x*c5) + (y*c5) + (y*c4) + ((y-(l-x))*c4) + ((y-(l-x))*c5)
if l > y:
    cena = ((l-y)*c2) + ((l-y)*c3) + ((l-(l-y))*c1) + (y*c4) + (y*c5) + (x*c5) + (x*c4) + ((x-(l-y))*c4) + ((x-(l-y))*c5)
if l < x:
    cena = (l*c1) + (x*c4) + (x*c5) + ((x-l)*c4) + ((x-l)*c5) + (2*((y*c4) + (y*c5)))
if l < y:
    cena = (l*c1) + (y*c4) + (y*c5) + ((y-l)*c4) + ((y-l)*c5) + (2*((x*c4) + (x*c5)))
if l == x:
    cena = (l*c1) + (x*c4) + (x*c5) + (2*((y*c5) + (y*c4)))
if l == y:
    cena = (l*c1) + (y*c4) + (y*c5) + (2*((x*c5) + (x*c4)))
print(cena)

